/* Copyright (c) 2019-2025 Allwinner Technology Co., Ltd. ALL rights reserved.
 *
 * Allwinner is a trademark of Allwinner Technology Co.,Ltd., registered in
 *the the People's Republic of China and other countries.
 * All Allwinner Technology Co.,Ltd. trademarks are used with permission.
 *
 * DISCLAIMER
 * THIRD PARTY LICENCES MAY BE REQUIRED TO IMPLEMENT THE SOLUTION/PRODUCT.
 * IF YOU NEED TO INTEGRATE THIRD PARTY’S TECHNOLOGY (SONY, DTS, DOLBY, AVS OR MPEGLA, ETC.)
 * IN ALLWINNERS’SDK OR PRODUCTS, YOU SHALL BE SOLELY RESPONSIBLE TO OBTAIN
 * ALL APPROPRIATELY REQUIRED THIRD PARTY LICENCES.
 * ALLWINNER SHALL HAVE NO WARRANTY, INDEMNITY OR OTHER OBLIGATIONS WITH RESPECT TO MATTERS
 * COVERED UNDER ANY REQUIRED THIRD PARTY LICENSE.
 * YOU ARE SOLELY RESPONSIBLE FOR YOUR USAGE OF THIRD PARTY’S TECHNOLOGY.
 *
 *
 * THIS SOFTWARE IS PROVIDED BY ALLWINNER"AS IS" AND TO THE MAXIMUM EXTENT
 * PERMITTED BY LAW, ALLWINNER EXPRESSLY DISCLAIMS ALL WARRANTIES OF ANY KIND,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING WITHOUT LIMITATION REGARDING
 * THE TITLE, NON-INFRINGEMENT, ACCURACY, CONDITION, COMPLETENESS, PERFORMANCE
 * OR MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.
 * IN NO EVENT SHALL ALLWINNER BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
 * SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
 * NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS, OR BUSINESS INTERRUPTION)

#define SUNXI_GPRCM_BASE                (0x40050000)
#define USB_BIAS_CTRL                   (0x0064)
#define USB_BIAS_CTRL_EN                (0x0001)
#endif

/* USB_PHY_CTL 40nm */
#define USB_PHYCTL40NM_SIDDQ        (0X0002)
#define USB_PHYCTL40NM_VCCLK        (0X0001)
/* USB_PHY_CTL 28nm */
#define USB_PHYCTL28NM_SIDDQ        (0X0008)
#define USB_PHYCTL28NM_VBUSVLDEXT   (0X0020)
/* USB_PHY_SEL */
#define USB_PHYSEL_OTG_SEL        (0x0001)
#define USB_PHY_OFFSET_CTRL        0x10
#define USB_PHY_OFFSET_TUNE        0x18
#define USB_PHY_OFFSET_STATUS   0x24
/*phy read/write vc-bus contrl register*/
#define USB_PHY_CTRL_VC_CLK        (0x1 << 0)    //bit0
#define USB_PHY_CTRL_VC_EN        (0x1 << 1)    //bit1
#define USB_PHY_CTRL_VC_DI        (0x1 << 7)    //bit7
#define USB_PHY_CTRL_VC_ADDR        (0xff << 8)    //bit8-15
#define USB_PHY_STATUS_VC_DO        (0x1 << 0)    //bit0

/* Register operations */
#define DRV_WriteReg(addr, data)    hal_writew(data, addr)
#define DRV_Reg(addr)            hal_readw(addr)
#define DRV_WriteReg32(addr, data)    hal_writel(data, addr)
#define DRV_Reg32(addr)            hal_readl(addr)
#define DRV_WriteReg8(addr, data)    hal_writeb(data, addr)
#define DRV_Reg8(addr)            hal_readb(addr)
#define USB_DRV_WriteReg(addr, data)    hal_writew(data, addr)
#define USB_DRV_Reg(addr)        hal_readw(addr)
#define USB_DRV_WriteReg32(addr, data)    hal_writel(data, addr)
#define USB_DRV_Reg32(addr)        hal_readl(addr)
#define USB_DRV_WriteReg8(addr, data)    hal_writeb(data, addr)
#define USB_DRV_Reg8(addr)        hal_readb(addr)
#define USB_DRV_ClearBits(addr, data)     \
    {                                 \
        uint16_t temp;            \
        temp = DRV_Reg(addr);     \
        temp &= ~(data);          \
        DRV_WriteReg(addr, temp); \
    }

#define USB_DRV_SetBits(addr, data)       \
    {                                 \
        uint16_t temp;            \
        temp = DRV_Reg(addr);     \
        temp |= (data);           \
        DRV_WriteReg(addr, temp); \
    }
#define USB_DRV_ClearBits32(addr, data)     \
    {                                   \
        uint32_t temp;              \
        temp = DRV_Reg32(addr);     \
        temp &= ~(data);            \
        DRV_WriteReg32(addr, temp); \
    }
#define USB_DRV_SetBits32(addr, data)       \
    {                                   \
        uint32_t temp;              \
        temp = DRV_Reg32(addr);     \
        temp |= (data);             \
        DRV_WriteReg32(addr, temp); \
    }
#define USB_DRV_ClearBits8(addr, data)     \
    {                                  \
        uint8_t temp;              \
        temp = DRV_Reg8(addr);     \
        temp &= ~(data);           \
        DRV_WriteReg8(addr, temp); \
    }

#define USB_DRV_SetBits8(addr, data)       \
    {                                  \
        uint8_t temp;              \
        temp = DRV_Reg8(addr);     \
        temp |= (data);            \
        DRV_WriteReg8(addr, temp); \
    }

struct platform_usb_config {
    unsigned char *name;
    unsigned int pbase;
    unsigned int irq;
    unsigned int ohci_clk;
    unsigned int usb_clk;
    unsigned int usb_rst;
    unsigned int phy_clk;
    unsigned int phy_rst;
};

typedef struct {
    /* common registers */
    /* fifo */
    uint32_t fifo0;          /* USBEndpoint0FIFORegister */
    uint32_t fifo1;          /* USBEndpoint1FIFORegister */
    uint8_t revered1[56]; /* 0x0000 + N*4 */
    uint8_t power;          /* 0x0040 */
    uint8_t devctl;          /* 0x0041 */
    uint8_t index;          /* 0x0042 */
    uint8_t vend0;          /* 0x0043 */
    uint16_t intrtx;      /* 0x0044 */
    uint16_t intrrx;      /* 0x0046 */
    uint16_t intrtxe;     /* 0x0048 */
    uint16_t intrrxe;     /* 0x004a */
    uint32_t intrusb;     /* 0x004c */
    uint32_t intrusbe;    /* 0x0050 */
    uint32_t frame;          /* 0x0054 */
    uint32_t reserved1[9];
    uint32_t testmode; /* 0x007c */
    /* indexed registers */
    uint16_t txmap;        /* 0x0080 */
    uint8_t txcsrl;        /* 0x0082 */
    uint8_t txcsrh;        /* 0x0083 */
    uint16_t rxmap;        /* 0x0084 */
    uint8_t rxcsrl;        /* 0x0086 */
    uint8_t rxcsrh;        /* 0x0087 */
    uint16_t rxcount;   /* 0x0088 */
    uint16_t rqpktcount;   /* 0x008a */
    uint8_t txtype;        /* 0x008c */
    uint8_t txinterval; /* 0x008d */
    uint8_t rxtype;        /* 0x008e */
    uint8_t rxinterval; /* 0x008f */
    /* OTG, dynamic FIFO, version & vendor registers */
    uint16_t txfifosz;  /* 0x0090 */
    uint16_t txfifoadd; /* 0x0092 */
    uint16_t rxfifosz;  /* 0x0094 */
    uint16_t rxfifoadd; /* 0x0096 */
    uint8_t faddr;        /* 0x0098 */
} UDC_REGISTER_T;

typedef struct {
    uint32_t iscr;          /* 0x0400 */
    uint32_t phyctrl40nm; /* 0x0404 */
    uint32_t phybist;     /* 0x0408 */
    uint32_t reserved1;
    uint32_t phyctrl28nm; /* 0x0410 */
    uint32_t phytest;     /* 0x0414 */
    uint32_t phytune;     /* 0x0418 */
    uint32_t reserved2;
    uint32_t physel; /* 0x0420 */
    uint32_t physta; /* 0x0424 */
} USBPHY_REGISTER_T;

typedef enum {
    UDC_IO_TYPE_PIO = 0,
    UDC_IO_TYPE_DMA,
} udc_io_type_t;
typedef enum {
    UDC_EP_TYPE_EP0 = 0,
    UDC_EP_TYPE_TX,
    UDC_EP_TYPE_RX,
} udc_ep_type_t;

typedef enum {
    USB_EP0_STATE_SETUP = 0x0,      /**< SETUP DATA */
    USB_EP0_STATE_IN_DATA = 0x1,    /**< IN DATA */
    USB_EP0_STATE_OUT_DATA = 0x3,   /**< OUT DATA */
    USB_EP0_STATE_IN_STATUS = 0x4,  /**< IN status */
    USB_EP0_STATE_OUT_STATUS = 0x5, /**< OUT status */
    USB_EP0_STATE_IN_ZLP = 0x6,     /**< OUT status */
    USB_EP0_STATE_STALL = 0x7,      /**< STALL status */
} ep0_state_t;

/* Endpoint state */
struct udc_ep_state {
    uint16_t ep_mps;    /* Endpoint max packet size */
    uint8_t ep_type;    /* Endpoint type */
    uint8_t ep_stalled; /* Endpoint stall flag */
    uint8_t ep_enable;  /* Endpoint enable */
    uint8_t *xfer_buf;
    uint32_t xfer_len;
    uint32_t actual_xfer_len;
};

